STMicroelectronics/STM32CubeMP1/Drivers/BSP/STM32MP15xx_DISCO/stm32mp15xx_disco_stpmu1.c
}


void STPMU1_IrqHandler(void)
{
  uint8_t irq_reg,mask,latch_events,i;

  for (irq_reg = 0 ; irq_reg < STM32_PMIC_NUM_IRQ_REGS ; irq_reg++)
  {
    /* Get latch events & active mask from register */
    mask = STPMU1_Register_Read(ITMASK1_REG+irq_reg);
    latch_events = STPMU1_Register_Read(ITLATCH1_REG+irq_reg) & ~mask ;

    /* Go through all bits for each register */
    for (i = 0 ; i < 8 ; i++ )
    {
      if ( latch_events & ( 1 << i ) )
      {
        /* Callback with parameter computes as "PMIC Interrupt" enum */
        STPMU1_INTn_Callback( (PMIC_IRQn )(irq_reg*8 + (7-i)));
      }
    }
    /* Clear events in appropriate register for the event with mask set */
    STPMU1_Register_Write(ITCLEARLATCH1_REG+irq_reg, latch_events );
  }

}


/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
static void My_Error_Handler(void)
{
  /* Error if LED1 is slowly blinking (1 sec. period) */
  while(1)
  {    
    //BSP_LED_Toggle(LED4);
    HAL_Delay(500);
  } 
}


void STPMU1_Sw_Reset(void)
{
  /* Write 1 in bit 0 of MAIN_CONTROL Register */
  STPMU1_Register_Update(MAIN_CONTROL_REG, SET , SOFTWARE_SWITCH_OFF_ENABLED );
  return ;
}

void STPMU1_Regulator_Enable(PMIC_RegulId_TypeDef id)
{
  regul_struct *regul = STPMU1_Get_Regulator_Data(id);

  STPMU1_Register_Update(regul->control_reg,BIT(0),BIT(0));
}

void STPMU1_Regulator_Disable(PMIC_RegulId_TypeDef id)
{
  regul_struct *regul = STPMU1_Get_Regulator_Data(id);

  STPMU1_Register_Update(regul->control_reg,0,BIT(0));
}

uint8_t STPMU1_Is_Regulator_Enabled(PMIC_RegulId_TypeDef id)
{
  uint8_t val ;

  regul_struct *regul = STPMU1_Get_Regulator_Data(id);

  val = STPMU1_Register_Read(regul->control_reg);

  return (val&0x1);
}

void STPMU1_Regulator_Voltage_Set(PMIC_RegulId_TypeDef id,uint16_t milivolts)
{
  uint8_t voltage_index = STPMU1_Voltage_Find_Index(id,milivolts);
  regul_struct *regul = STPMU1_Get_Regulator_Data(id);
  STPMU1_Register_Update(regul->control_reg, voltage_index<<2 , 0xFC );
}

/* register direct access */
uint8_t STPMU1_Register_Read(uint8_t register_id)
{
  uint32_t status = BSP_ERROR_NONE;
  uint8_t Value = 0;

  status = BSP_I2C4_ReadReg(STPMU1_I2C_ADDRESS, (uint16_t)register_id, &Value, 1);

  /* Check the communication status */
  if(status != BSP_ERROR_NONE)
  {
    My_Error_Handler();
  }
  return Value;
}

void STPMU1_Register_Write(uint8_t register_id, uint8_t value)
{
  uint32_t status = BSP_ERROR_NONE;

  status = BSP_I2C4_WriteReg(STPMU1_I2C_ADDRESS, (uint16_t)register_id, &value, 1);

  /* Check the communication status */
  if(status != BSP_ERROR_NONE)
  {
    My_Error_Handler();
  }

  /* verify register content */
  if ((register_id!=WATCHDOG_CONTROL_REG) && (register_id<=0x40))
  {
    uint8_t readval = STPMU1_Register_Read(register_id);
    if (readval != value)
    {
      My_Error_Handler();
    }
  }
  return ;
}

void STPMU1_Register_Update(uint8_t register_id, uint8_t value, uint8_t mask)
{
  uint8_t initial_value ;

  initial_value = STPMU1_Register_Read(register_id);

  /* Clear bits to update */
  initial_value &= ~mask;

  /* Update appropriate bits*/
  initial_value |= ( value & mask );

  /* Send new value on I2C Bus */
  STPMU1_Register_Write(register_id, initial_value);

  return ;
}


/*
 *
 * PMIC init
 *    pmic provides power supply on this board
 *    it is configured to turn off some power supply in standby mode
 *
 */


static uint32_t BSP_PMIC_MspInit(I2C_HandleTypeDef *hi2c)
{
  uint32_t  status = BSP_ERROR_NONE;
  GPIO_InitTypeDef  GPIO_InitStruct;

  /*##-1- Configure the I2C clock source, GPIO and Interrupt #*/
  BSP_I2C4_Init();

  /*##-2- Configure PMIC GPIOs Interface ########################################*/

  /* INTn - Interrupt Line - Active Low (Falling Edge) */
  PMIC_INTn_CLK_ENABLE();
  GPIO_InitStruct.Pin       = PMIC_INTn_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull      = GPIO_PULLUP; //GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = 0 ;
  BSP_ENTER_CRITICAL_SECTION(PMIC_INTn_PORT);
  HAL_GPIO_Init(PMIC_INTn_PORT, &GPIO_InitStruct);
  BSP_EXIT_CRITICAL_SECTION(PMIC_INTn_PORT);

  /* Enable and set INTn EXTI Interrupt  */
#if defined(CORE_CA7)
  IRQ_SetPriority(EXTI0_IRQn, 0);
  IRQ_Enable(EXTI0_IRQn);
#elif defined(CORE_CM4)
  HAL_NVIC_SetPriority(EXTI0_IRQn, BSP_PMU1_IT_PRIORITY, 0x00);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);
#endif

  return status;
}


static uint32_t BSP_PMIC_MspDeInit(I2C_HandleTypeDef *hi2c)
{
  uint32_t  status = BSP_ERROR_NONE;
/*##-1- Reset I2C Clock / Disable peripherals and GPIO Clocks###############*/
  status = BSP_I2C4_DeInit();

  /*##-2- Disable PMIC clk ###########################################*/
  PMIC_INTn_CLK_DISABLE();

  /*##-3- Disable the NVIC for PMIC ##########################################*/
#if defined(CORE_CA7)
  IRQ_Disable(EXTI0_IRQn);
#elif defined(CORE_CM4)
  HAL_NVIC_DisableIRQ(EXTI0_IRQn);
#endif
  BSP_ENTER_CRITICAL_SECTION(PMIC_INTn_PORT);
  HAL_GPIO_DeInit(PMIC_INTn_PORT,PMIC_INTn_PIN);
  BSP_EXIT_CRITICAL_SECTION(PMIC_INTn_PORT);

  return status;
}

uint32_t BSP_PMIC_Is_Device_Ready(void)
{
  uint32_t  status = BSP_ERROR_NONE;

  /* Write the TxBuffer1 at @0, then read @0 when device ready */
  if (BSP_I2C4_IsReady(STPMU1_I2C_ADDRESS, 1) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_BUSY;
  }
  return status ;
}

/* Use Xls I2C COnfiguration Tools with I2C Clock config + output clocks requirement */
#define I2C_TIMING     0x10805E89

uint32_t BSP_PMIC_Init(void)
{
  uint32_t status = BSP_ERROR_NONE;
  int i;

  /*##-1- Configure the I2C peripheral ######################################*/
  BSP_PMIC_MspInit(&hI2c4);

  status = BSP_PMIC_Is_Device_Ready();
  if ( status != BSP_ERROR_NONE )
  {
    return status;
  }

  if (STPMU1_Register_Read(VERSION_STATUS_REG) != 0x00)
  {
    return BSP_ERROR_BUS_FAILURE;
  }

  STPMU1_Enable_Interrupt(IT_PONKEY_R);
  STPMU1_Enable_Interrupt(IT_PONKEY_F);
  /* enable all irqs  */
  for (i=0; i<IRQ_NR; i++) {
    STPMU1_Enable_Interrupt(i);
  }

